/*********************************************************************************************************************
* CYT4BB Opensourec Library ï¿½ï¿½ï¿½ï¿½ CYT4BB ï¿½ï¿½Ô´ï¿½â£©ï¿½ï¿½Ò»ï¿½ï¿½ï¿½ï¿½ï¿½Ú¹Ù·ï¿½ SDK ï¿½Ó¿ÚµÄµï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ô´ï¿½ï¿½
* Copyright (c) 2022 SEEKFREE ï¿½ï¿½É¿Æ¼ï¿?
*
* ï¿½ï¿½ï¿½Ä¼ï¿½ï¿½ï¿½ CYT4BB ï¿½ï¿½Ô´ï¿½ï¿½ï¿½Ò»ï¿½ï¿½ï¿½ï¿?
*
* CYT4BB ï¿½ï¿½Ô´ï¿½ï¿½ ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿?
* ï¿½ï¿½ï¿½ï¿½ï¿½Ô¸ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½á·?ï¿½ï¿½ï¿½ï¿½ GPLï¿½ï¿½GNU General Public Licenseï¿½ï¿½ï¿½ï¿½ GNUÍ¨ï¿½Ã¹ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ö¤ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
* ï¿½ï¿½ GPL ï¿½Äµï¿½3ï¿½æ£¨ï¿½ï¿½ GPL3.0ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ñ¡ï¿½ï¿½Ä£ï¿½ï¿½ÎºÎºï¿½ï¿½ï¿½ï¿½Ä°æ±¾ï¿½ï¿½ï¿½ï¿½ï¿½Â·ï¿½ï¿½ï¿½ï¿½ï¿?/ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½
*
* ï¿½ï¿½ï¿½ï¿½Ô´ï¿½ï¿½Ä·ï¿½ï¿½ï¿½ï¿½ï¿½Ï£ï¿½ï¿½ï¿½ï¿½ï¿½Ü·ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ã£ï¿½ï¿½ï¿½ï¿½ï¿½Î´ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ÎºÎµÄ±ï¿½Ö?
* ï¿½ï¿½ï¿½ï¿½Ã»ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ô»ï¿½ï¿½Êºï¿½ï¿½Ø¶ï¿½ï¿½ï¿½Í¾ï¿½Ä±ï¿½Ö¤
* ï¿½ï¿½ï¿½ï¿½Ï¸ï¿½ï¿½ï¿½ï¿½Î¼ï¿? GPL
*
* ï¿½ï¿½Ó¦ï¿½ï¿½ï¿½ï¿½ï¿½Õµï¿½ï¿½ï¿½ï¿½ï¿½Ô´ï¿½ï¿½ï¿½Í?Ê±ï¿½Õµï¿½Ò»ï¿½ï¿½ GPL ï¿½Ä¸ï¿½ï¿½ï¿½
* ï¿½ï¿½ï¿½Ã»ï¿½Ð£ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½<https://www.gnu.org/licenses/>
*
* ï¿½ï¿½ï¿½ï¿½×¢ï¿½ï¿½ï¿½ï¿½
* ï¿½ï¿½ï¿½ï¿½Ô´ï¿½ï¿½Ê¹ï¿½ï¿½ GPL3.0 ï¿½ï¿½Ô´ï¿½ï¿½ï¿½ï¿½Ö¤Ð­ï¿½ï¿½ ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Îªï¿½ï¿½ï¿½Ä°æ±¾
* ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ó¢ï¿½Ä°ï¿½ï¿½ï¿½ libraries/doc ï¿½Ä¼ï¿½ï¿½ï¿½ï¿½Âµï¿½ GPL3_permission_statement.txt ï¿½Ä¼ï¿½ï¿½ï¿½
* ï¿½ï¿½ï¿½ï¿½Ö¤ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ libraries ï¿½Ä¼ï¿½ï¿½ï¿½ï¿½ï¿½ ï¿½ï¿½ï¿½ï¿½ï¿½Ä¼ï¿½ï¿½ï¿½ï¿½Âµï¿½ LICENSE ï¿½Ä¼ï¿½
* ï¿½ï¿½Ó­ï¿½ï¿½Î»Ê¹ï¿½Ã²ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ ï¿½ï¿½ï¿½Þ¸ï¿½ï¿½ï¿½ï¿½ï¿½Ê±ï¿½ï¿½ï¿½ë±£ï¿½ï¿½ï¿½ï¿½É¿Æ¼ï¿½ï¿½Ä°ï¿½È?ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
*
* ï¿½Ä¼ï¿½ï¿½ï¿½ï¿½ï¿½          main_cm7_1
* ï¿½ï¿½Ë¾ï¿½ï¿½ï¿½ï¿½          ï¿½É¶ï¿½ï¿½ï¿½É¿Æ¼ï¿½ï¿½ï¿½ï¿½Þ¹ï¿½Ë?
* ï¿½æ±¾ï¿½ï¿½Ï¢          ï¿½é¿´ libraries/doc ï¿½Ä¼ï¿½ï¿½ï¿½ï¿½ï¿½ version ï¿½Ä¼ï¿½ ï¿½æ±¾Ëµï¿½ï¿½
* ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½          IAR 9.40.1
* ï¿½ï¿½ï¿½ï¿½Æ½Ì¨          CYT4BB
* ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½          https://seekfree.taobao.com/
*
* ï¿½Þ¸Ä¼ï¿½Â¼
* ï¿½ï¿½ï¿½ï¿½              ï¿½ï¿½ï¿½ï¿½                ï¿½ï¿½×¢
* 2024-1-4       pudding            first version
********************************************************************************************************************/

#include "zf_common_headfile.h"
#include "trace.h"

#pragma location = 0x28001000
float m7_1_data[5] = {0};
//ï¿½ï¿½Ö·ï¿½ä¶¯50*4=200byte,0x28001000 + 200(C8)

#define M1_speed m7_1_data[0]
#define Battery_V m7_1_data[1]

void Baterry_ChecK(){
  if(Battery_V>= 6  &&  Battery_V <= 7.3 ){//2s
    for(uint8_t i = 0;i<10;i++){
      gpio_toggle_level(P19_4);
      system_delay_ms(100);
    }
    gpio_set_level(P19_4,0);
  }
  //3s
  else if(Battery_V >= 9  &&  Battery_V <= 10.8 ){
    for(uint8_t i = 0;i<10;i++){
      gpio_toggle_level(P19_4);
      system_delay_ms(100);
    }
    gpio_set_level(P19_4,0);
  }
}

int main(void)
{
    clock_init(SYSTEM_CLOCK_250M); 	// Ê±ÖÓÅäÖÃ¼°ÏµÍ³³õÊ¼»¯<Îñ±Ø±£Áô>
    debug_info_init();                  // µ÷ÊÔ´®¿ÚÐÅÏ¢³õÊ¼»¯
    
    //GPIO Init
    gpio_init(P20_0,GPI,1,GPI_PULL_UP);//Key
    gpio_init(P20_3,GPI,1,GPI_PULL_UP);//Key
    gpio_init(P20_2,GPI,1,GPI_PULL_UP);//Key
    gpio_init(P19_0,GPO,1,GPO_PUSH_PULL);//LED in the board P19_0
    gpio_init(P19_4,GPO,0,GPO_PUSH_PULL);//buzzer P19_4  
    gpio_init(P06_1,GPO,0,GPO_PUSH_PULL);//Moter_en
  
    timer_init(TC_TIME2_CH1, TIMER_US);//¶¨Ê±Æ÷³õÊ¼»¯
    timer_init(TC_TIME2_CH0, TIMER_US);//¶¨Ê±Æ÷³õÊ¼»¯

    adc_init(ADC0_CH00_P06_0, ADC_12BIT); //ADC³õÊ¼»¯
    while(true)
    {
        timer_clear(TC_TIME2_CH1);
        timer_start(TC_TIME2_CH1);
        SCB_CleanInvalidateDCache_by_Addr(&m7_1_data, sizeof(m7_1_data));//¸üÐÂÄÚ´æµØÖ·
        Baterry_ChecK();                                                  //¼ì²âµç³ØµçÑ¹
        ///////////////////////////////////////²âËÙÇø¼ä///////////////////////////////////////////
        Battery_V = (float)adc_convert(ADC0_CH00_P06_0)/4096 * 3.3*4.1;
        system_delay_ms(4);//Prevent memory update problems due to too fast speed
        //////////////////////////////////////²âÊÔÇø¼ä//////////////////////////////////////////
        M1_speed = timer_get(TC_TIME2_CH1);
        timer_stop(TC_TIME2_CH1);
    }
}

// **************************** ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ ****************************